cask_args appdir: '/Applications'

tap 'homebrew/bundle'

tap 'caskroom/fonts'
cask 'font-mononoki'

cask '1password'
cask 'alfred'
cask 'anki'
cask 'duet'
cask 'java'
cask 'karabiner-elements'
cask 'mactex'
cask 'postman'
cask 'slack'
cask 'spotify'

brew 'python'
brew 'python@2'

brew 'asciidoc'
brew 'autossh'
brew 'awscli'
brew 'bash-completion'
brew 'brew-pip'
brew 'chezscheme'
brew 'dash'
brew 'dialog'
brew 'fzf'
brew 'git'
brew 'git-crypt'
brew 'gnupg'
brew 'go'
brew 'graphviz'
brew 'gtypist'
brew 'hub'
brew 'ii'
brew 'jq'
brew 'kakoune'
brew 'kubernetes-cli'
brew 'leiningen'
brew 'node'
brew 'nvm'
brew 'reattach-to-user-namespace'
brew 'rlwrap'
brew 'rustup-init'
brew 'sassc'
brew 'terraform'
brew 'the_silver_searcher'
brew 'tmate'
brew 'tmux'
brew 'vault'
brew 'vim', args: ['HEAD']
brew 'weechat', args: ['with-python@2']
brew 'wget'
brew 'z'

tap 'robdimsdale/tap'
brew 'wl'

brew 'ul/kak-lsp/kak-lsp'

# ErgoDox environment
tap 'osx-cross/avr'
tap 'PX4/homebrew-px4'
brew 'avr-gcc'
brew 'avrdude'
brew 'dfu-programmer'
brew 'teensy_loader_cli', args: ['with-libusb-compat']
