cask_args appdir: '/Applications'

tap 'caskroom/fonts'
cask 'font-mononoki'

tap 'homebrew/bundle'
tap 'neovim/neovim'
tap 'robdimsdale/tap'

cask '1password'
cask 'anki'
cask 'duet'
cask 'evernote'
#cask 'google-chrome'
cask 'java'
cask 'mactex'
cask 'postman'
cask 'slack'
cask 'spotify'

brew 'python'

brew 'agda'
brew 'autossh'
brew 'awscli'
brew 'bash-completion'
brew 'chezscheme'
brew 'fzy'
brew 'git'
brew 'git-crypt'
brew 'gnupg'
brew 'go'
brew 'graphviz'
brew 'gtypist'
brew 'haskell-stack'
brew 'jq'
brew 'kubernetes-cli'
brew 'leiningen'
brew 'node'
brew 'nvm'
brew 'reattach-to-user-namespace'
brew 'rlwrap'
brew 'sassc'
brew 'terraform'
brew 'tmate'
brew 'tmux'
brew 'vault'
brew 'vim', args: ['HEAD']
brew 'wget'
brew 'z'

# ErgoDox environment
tap 'osx-cross/avr'
tap 'PX4/homebrew-px4'
brew 'avr-gcc'
brew 'dfu-programmer'
brew 'avrdude'
