cask_args appdir: '/Applications'

cask 'zoomus'

tap 'caskroom/fonts'
cask 'font-fira-code'

tap 'homebrew/bundle'
tap 'neovim/neovim'

cask '1password'
cask 'anki'
cask 'discord'
cask 'docker'
cask 'emacs'
cask 'evernote'
cask 'java'
cask 'mactex'
cask 'marked'
cask 'screenhero'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'xquartz'

brew 'python'

brew 'agda'
brew 'awscli'
brew 'bash-completion'
brew 'bitchx'
brew 'coq'
brew 'docker-compose'
brew 'git'
brew 'git-crypt'
brew 'git-test'
brew 'go'
brew 'gpg2'
brew 'graphviz'
brew 'idris'
brew 'leiningen'
brew 'maven'
brew 'neovim', args: ['HEAD']
brew 'nodejs'
brew 'proof-general'
brew 'reattach-to-user-namespace'
brew 'rlwrap'
brew 'sassc'
brew 'terraform'
brew 'tmate'
brew 'tmux'
brew 'vault'
brew 'wget'
brew 'xhyve', args: ['HEAD']
brew 'z'

brew './scheme/chezscheme.rb'
